# Pandas Lecture Lab Activity

What is CRUD?

Create, Read, Update. ande Delete

Using pandas import the Module 7 Lecture Lab Activity.csv

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('Module_7_Lecture_Lab_Activity.csv', encoding='ISO-8859-1')

Show the header for the CSV.

In [5]:
df.head()

             Names                                    Type of Candy   Cost
0           Damien                                       Almond Joy   1.96
1   adalynn gilman                                           Reeses   1.48
2  Noah Papenbrock  Hershey's Special Dark Zero Sugar Chocolate Bar   2.48
3            Mrwan                                         Snickers   1.00
4       Trenton Ly                                          Reese's  23.87

Show the first 15 rows of the CSV.

In [6]:
df.head(15)

                 Names                                    Type of Candy   Cost
0               Damien                                       Almond Joy   1.96
1       adalynn gilman                                           Reeses   1.48
2      Noah Papenbrock  Hershey's Special Dark Zero Sugar Chocolate Bar   2.48
3                Mrwan                                         Snickers   1.00
4           Trenton Ly                                          Reese's  23.87
5   alexander kauffman                                       Almond Joy   1.48
6       William Espich                                         Skittles   3.28
7             Andres H                                           reeces   1.20
8       Blake Tippmann                                     3 musketeers   1.48
9          Elijah Kite                                   Jolly Ranchers  18.69
10    Nick Schuhmacher                                            mints   1.50
11        Kevin Nguyen                                         Snickers   0.98
12       Chase McCarel                                        Milky Way   0.74
13                 Eja                             Skittles (50 oz bag)   9.98
14      Sarah Martinez                                             Twix   0.88

Show the last 7 rows of the CSV.

In [7]:
df.tail(7)

                 Names            Type of Candy  Cost
106      Jaxon Worrell           Jolly Ranchers  0.99
107             Emmett                   take 5  0.99
108      Michael Drane  Trolli sour gummy worms  0.99
109        Sean Wilson  Mike N Ikes or Skittles  1.99
110               izzy              gummy bears  1.99
111              brina                   reeses  1.99
112  kennedy ledbbeter            almond heresy  1.99

Show all the Columns of the CSV.

In [8]:
df.columns

Index(['Names', 'Type of Candy', 'Cost'], dtype='object')

Show the specific data types of the CSV.

In [9]:
df.dtypes

Names             object
Type of Candy     object
Cost             float64
dtype: object

Show a statistical summary of the CSV.

In [10]:
df.describe()

             Cost
count  113.000000
mean     2.391416
std      3.623166
min      0.740000
25%      0.990000
50%      1.160000
75%      1.990000
max     23.870000

What objects are not included in the statistical summary?
How can I get the objects that are not included?

What is not include is object

In [11]:
# write the code to show me how to get the objects that are not included

In [12]:
df.describe(include='object')

         Names Type of Candy
count      113           113
unique      53            75
top     Damien      Snickers
freq         3             6

Show how to filter the names from the rest of the table?

In [13]:
df['Names']

0                 Damien
1         adalynn gilman
2        Noah Papenbrock
3                  Mrwan
4             Trenton Ly
             ...
108        Michael Drane
109          Sean Wilson
110                 izzy
111                brina
112    kennedy ledbbeter
Name: Names, Length: 113, dtype: object

Show me the unique names.

In [14]:
df.Names.unique()

array(['Damien', 'adalynn gilman', 'Noah Papenbrock', 'Mrwan',
       'Trenton Ly', 'alexander kauffman', 'William Espich', 'Andres H',
       'Blake Tippmann', 'Elijah Kite', 'Nick Schuhmacher',
       'Kevin Nguyen', 'Chase McCarel', 'Eja', 'Sarah Martinez',
       'Gabriel Moore', 'brianna', 'Cathy Wise', 'alexis', 'Audrey marks',
       'Xayne Blair', 'Corban Saylor', 'Langston', 'Allan', 'Kim',
       'Bryce Bland', 'Troy', 'shaheim', 'jasiah waxton', 'edaevion',
       'Hong Rot', 'Ethan Morse', 'Ibrahim Nokour', 'Kevin Carter',
       'braniah', 'Tate Rex', 'faith', 'Juan Ruiz', 'Chris McCalla',
       'Riley Wilds', 'Christian Rogers', 'Leo',
       'Nor Aisa Binti Abdul Molna', 'Sa Hay', 'Grant Simpson', 'maya',
       'Jaxon Worrell', 'Emmett', 'Michael Drane', 'Sean Wilson', 'izzy',
       'brina', 'kennedy ledbbeter'], dtype=object)

Show me only the rows that are under $1.00

In [15]:
df[df['Cost']=='1.00']

Empty DataFrame
Columns: [Names, Type of Candy, Cost]
Index: []

Show only the rows 17 to 37

In [16]:
df.iloc[17:37]

                 Names               Type of Candy  Cost
17          Cathy Wise                     Snicker  1.19
18              alexis                 Gummy Bears  1.00
19        Audrey marks                   heath bar  1.63
20         Xayne Blair                    Skittles  2.28
21       Corban Saylor                3 musketeers  1.48
22            Langston                      Reeses  1.96
23               Allan                 Hershey Bar  0.88
24                 Kim           Reese's Chocolate  1.48
25         Bryce Bland          Hersheys Candy Bar  0.88
26                Troy      cookie n crème Hershey  1.48
27             shaheim                  Candy Corn  2.28
28       jasiah waxton  Kit Kat Minis, White Creme  2.98
29            edaevion                  Almond Joy  1.64
30              Damien                     Reece's  2.06
31      adalynn gilman                  Lifesavers  5.28
32     Noah Papenbrock     Great Value Peach Rings  0.98
33               Mrwan               Reeses take 5  2.98
34          Trenton Ly                    Kit Kats  9.94
35  alexander kauffman                      KitKat  1.48
36      William Espich                   Starburst  9.98

Show only the rows that are for Damien.

In [17]:
df[df['Names']=='Damien']

     Names Type of Candy  Cost
0   Damien    Almond Joy  1.96
30  Damien       Reece's  2.06
84  Damien       Reese's  1.99

Create a new column names is_candy and make all the rows True

In [ ]:
df['is_candy']
df[df['is_candy']==True].head()

Change the name of the row you created to Candy.

In [ ]:
df.rename(columns={'is_candy': 'Candy'}, inplace=True)
df.head()

,Names,Type of Candy,Cost,Candy
0,Damien,Almond Joy,1.96,True
1,adalynn gilman,Reeses,1.48,True
2,Noah Papenbrock,Hershey's Special Dark Zero Sugar Chocolate Bar,2.48,True
3,Mrwan,Snickers,1.00,True
4,Trenton Ly,Reese's,23.87,True

Write an statement that iterates through the list and finds all the Snicker or snickers

In [ ]:
df[(df['Type of Candy']=='Snicker') & (df['Type of Candy']=='snicker')]

Empty DataFrame
Columns: [Names, Type of Candy, Cost, Candy]
Index: []

Using iloc change the 3rd row's candy column to False

In [ ]:
df.iloc[0,3] = True
df.head()

,Names,Type of Candy,Cost,Candy
0,Damien,Almond Joy,1.96,True
1,adalynn gilman,Reeses,1.48,True
2,Noah Papenbrock,Hershey's Special Dark Zero Sugar Chocolate Bar,2.48,True
3,Mrwan,Snickers,1.00,True
4,Trenton Ly,Reese's,23.87,True

Output the table to a csv named 'your_last_name_mod7output.csv'

In [ ]:
df.to_csv('mault_mod7output.csv')

Drop the candy column permanently

In [ ]:
df.drop('Candy', axis=1, inplace=True)
df.head

<bound method NDFrame.head of                  Names                                    Type of Candy   Cost
0               Damien                                       Almond Joy   1.96
1       adalynn gilman                                           Reeses   1.48
2      Noah Papenbrock  Hershey's Special Dark Zero Sugar Chocolate Bar   2.48
3                Mrwan                                         Snickers   1.00
4           Trenton Ly                                          Reese's  23.87
..                 ...                                              ...    ...
108      Michael Drane                          Trolli sour gummy worms   0.99
109        Sean Wilson                          Mike N Ikes or Skittles   1.99
110               izzy                                      gummy bears   1.99
111              brina                                           reeses   1.99
112  kennedy ledbbeter                                    almond heresy   1.99

[113 rows x 3 columns]>

# Please turn in the completed Juypter Notebook along with your output csv to github. Make sure that I can see the notebook and it is not just the file as this sometimes does not work. A link to the location on the repo should be submitted.